----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [35, 64, 114, 114]           3,136
       BatchNorm2d-2         [35, 64, 114, 114]             128
              ReLU-3         [35, 64, 114, 114]               0
         MaxPool2d-4           [35, 64, 57, 57]               0
            Conv2d-5           [35, 64, 57, 57]           4,096
       BatchNorm2d-6           [35, 64, 57, 57]             128
              ReLU-7           [35, 64, 57, 57]               0
            Conv2d-8           [35, 64, 57, 57]          36,864
       BatchNorm2d-9           [35, 64, 57, 57]             128
             ReLU-10           [35, 64, 57, 57]               0
           Conv2d-11          [35, 256, 57, 57]          16,384
      BatchNorm2d-12          [35, 256, 57, 57]             512
           Conv2d-13          [35, 256, 57, 57]          16,384
      BatchNorm2d-14          [35, 256, 57, 57]             512
             ReLU-15          [35, 256, 57, 57]               0
       Bottleneck-16          [35, 256, 57, 57]               0
           Conv2d-17           [35, 64, 57, 57]          16,384
      BatchNorm2d-18           [35, 64, 57, 57]             128
             ReLU-19           [35, 64, 57, 57]               0
           Conv2d-20           [35, 64, 57, 57]          36,864
      BatchNorm2d-21           [35, 64, 57, 57]             128
             ReLU-22           [35, 64, 57, 57]               0
           Conv2d-23          [35, 256, 57, 57]          16,384
      BatchNorm2d-24          [35, 256, 57, 57]             512
             ReLU-25          [35, 256, 57, 57]               0
       Bottleneck-26          [35, 256, 57, 57]               0
           Conv2d-27           [35, 64, 57, 57]          16,384
      BatchNorm2d-28           [35, 64, 57, 57]             128
             ReLU-29           [35, 64, 57, 57]               0
           Conv2d-30           [35, 64, 57, 57]          36,864
      BatchNorm2d-31           [35, 64, 57, 57]             128
             ReLU-32           [35, 64, 57, 57]               0
           Conv2d-33          [35, 256, 57, 57]          16,384
      BatchNorm2d-34          [35, 256, 57, 57]             512
             ReLU-35          [35, 256, 57, 57]               0
       Bottleneck-36          [35, 256, 57, 57]               0
           Conv2d-37          [35, 128, 57, 57]          32,768
      BatchNorm2d-38          [35, 128, 57, 57]             256
             ReLU-39          [35, 128, 57, 57]               0
           Conv2d-40          [35, 128, 29, 29]         147,456
      BatchNorm2d-41          [35, 128, 29, 29]             256
             ReLU-42          [35, 128, 29, 29]               0
           Conv2d-43          [35, 512, 29, 29]          65,536
      BatchNorm2d-44          [35, 512, 29, 29]           1,024
           Conv2d-45          [35, 512, 29, 29]         131,072
      BatchNorm2d-46          [35, 512, 29, 29]           1,024
             ReLU-47          [35, 512, 29, 29]               0
       Bottleneck-48          [35, 512, 29, 29]               0
           Conv2d-49          [35, 128, 29, 29]          65,536
      BatchNorm2d-50          [35, 128, 29, 29]             256
             ReLU-51          [35, 128, 29, 29]               0
           Conv2d-52          [35, 128, 29, 29]         147,456
      BatchNorm2d-53          [35, 128, 29, 29]             256
             ReLU-54          [35, 128, 29, 29]               0
           Conv2d-55          [35, 512, 29, 29]          65,536
      BatchNorm2d-56          [35, 512, 29, 29]           1,024
             ReLU-57          [35, 512, 29, 29]               0
       Bottleneck-58          [35, 512, 29, 29]               0
           Conv2d-59          [35, 128, 29, 29]          65,536
      BatchNorm2d-60          [35, 128, 29, 29]             256
             ReLU-61          [35, 128, 29, 29]               0
           Conv2d-62          [35, 128, 29, 29]         147,456
      BatchNorm2d-63          [35, 128, 29, 29]             256
             ReLU-64          [35, 128, 29, 29]               0
           Conv2d-65          [35, 512, 29, 29]          65,536
      BatchNorm2d-66          [35, 512, 29, 29]           1,024
             ReLU-67          [35, 512, 29, 29]               0
       Bottleneck-68          [35, 512, 29, 29]               0
           Conv2d-69          [35, 128, 29, 29]          65,536
      BatchNorm2d-70          [35, 128, 29, 29]             256
             ReLU-71          [35, 128, 29, 29]               0
           Conv2d-72          [35, 128, 29, 29]         147,456
      BatchNorm2d-73          [35, 128, 29, 29]             256
             ReLU-74          [35, 128, 29, 29]               0
           Conv2d-75          [35, 512, 29, 29]          65,536
      BatchNorm2d-76          [35, 512, 29, 29]           1,024
             ReLU-77          [35, 512, 29, 29]               0
       Bottleneck-78          [35, 512, 29, 29]               0
           Conv2d-79          [35, 256, 29, 29]         131,072
      BatchNorm2d-80          [35, 256, 29, 29]             512
             ReLU-81          [35, 256, 29, 29]               0
           Conv2d-82          [35, 256, 15, 15]         589,824
      BatchNorm2d-83          [35, 256, 15, 15]             512
             ReLU-84          [35, 256, 15, 15]               0
           Conv2d-85         [35, 1024, 15, 15]         262,144
      BatchNorm2d-86         [35, 1024, 15, 15]           2,048
           Conv2d-87         [35, 1024, 15, 15]         524,288
      BatchNorm2d-88         [35, 1024, 15, 15]           2,048
             ReLU-89         [35, 1024, 15, 15]               0
       Bottleneck-90         [35, 1024, 15, 15]               0
           Conv2d-91          [35, 256, 15, 15]         262,144
      BatchNorm2d-92          [35, 256, 15, 15]             512
             ReLU-93          [35, 256, 15, 15]               0
           Conv2d-94          [35, 256, 15, 15]         589,824
      BatchNorm2d-95          [35, 256, 15, 15]             512
             ReLU-96          [35, 256, 15, 15]               0
           Conv2d-97         [35, 1024, 15, 15]         262,144
      BatchNorm2d-98         [35, 1024, 15, 15]           2,048
             ReLU-99         [35, 1024, 15, 15]               0
      Bottleneck-100         [35, 1024, 15, 15]               0
          Conv2d-101          [35, 256, 15, 15]         262,144
     BatchNorm2d-102          [35, 256, 15, 15]             512
            ReLU-103          [35, 256, 15, 15]               0
          Conv2d-104          [35, 256, 15, 15]         589,824
     BatchNorm2d-105          [35, 256, 15, 15]             512
            ReLU-106          [35, 256, 15, 15]               0
          Conv2d-107         [35, 1024, 15, 15]         262,144
     BatchNorm2d-108         [35, 1024, 15, 15]           2,048
            ReLU-109         [35, 1024, 15, 15]               0
      Bottleneck-110         [35, 1024, 15, 15]               0
          Conv2d-111          [35, 256, 15, 15]         262,144
     BatchNorm2d-112          [35, 256, 15, 15]             512
            ReLU-113          [35, 256, 15, 15]               0
          Conv2d-114          [35, 256, 15, 15]         589,824
     BatchNorm2d-115          [35, 256, 15, 15]             512
            ReLU-116          [35, 256, 15, 15]               0
          Conv2d-117         [35, 1024, 15, 15]         262,144
     BatchNorm2d-118         [35, 1024, 15, 15]           2,048
            ReLU-119         [35, 1024, 15, 15]               0
      Bottleneck-120         [35, 1024, 15, 15]               0
          Conv2d-121          [35, 256, 15, 15]         262,144
     BatchNorm2d-122          [35, 256, 15, 15]             512
            ReLU-123          [35, 256, 15, 15]               0
          Conv2d-124          [35, 256, 15, 15]         589,824
     BatchNorm2d-125          [35, 256, 15, 15]             512
            ReLU-126          [35, 256, 15, 15]               0
          Conv2d-127         [35, 1024, 15, 15]         262,144
     BatchNorm2d-128         [35, 1024, 15, 15]           2,048
            ReLU-129         [35, 1024, 15, 15]               0
      Bottleneck-130         [35, 1024, 15, 15]               0
          Conv2d-131          [35, 256, 15, 15]         262,144
     BatchNorm2d-132          [35, 256, 15, 15]             512
            ReLU-133          [35, 256, 15, 15]               0
          Conv2d-134          [35, 256, 15, 15]         589,824
     BatchNorm2d-135          [35, 256, 15, 15]             512
            ReLU-136          [35, 256, 15, 15]               0
          Conv2d-137         [35, 1024, 15, 15]         262,144
     BatchNorm2d-138         [35, 1024, 15, 15]           2,048
            ReLU-139         [35, 1024, 15, 15]               0
      Bottleneck-140         [35, 1024, 15, 15]               0
          Conv2d-141          [35, 512, 15, 15]         524,288
     BatchNorm2d-142          [35, 512, 15, 15]           1,024
            ReLU-143          [35, 512, 15, 15]               0
          Conv2d-144            [35, 512, 8, 8]       2,359,296
     BatchNorm2d-145            [35, 512, 8, 8]           1,024
            ReLU-146            [35, 512, 8, 8]               0
          Conv2d-147           [35, 2048, 8, 8]       1,048,576
     BatchNorm2d-148           [35, 2048, 8, 8]           4,096
          Conv2d-149           [35, 2048, 8, 8]       2,097,152
     BatchNorm2d-150           [35, 2048, 8, 8]           4,096
            ReLU-151           [35, 2048, 8, 8]               0
      Bottleneck-152           [35, 2048, 8, 8]               0
          Conv2d-153            [35, 512, 8, 8]       1,048,576
     BatchNorm2d-154            [35, 512, 8, 8]           1,024
            ReLU-155            [35, 512, 8, 8]               0
          Conv2d-156            [35, 512, 8, 8]       2,359,296
     BatchNorm2d-157            [35, 512, 8, 8]           1,024
            ReLU-158            [35, 512, 8, 8]               0
          Conv2d-159           [35, 2048, 8, 8]       1,048,576
     BatchNorm2d-160           [35, 2048, 8, 8]           4,096
            ReLU-161           [35, 2048, 8, 8]               0
      Bottleneck-162           [35, 2048, 8, 8]               0
          Conv2d-163            [35, 512, 8, 8]       1,048,576
     BatchNorm2d-164            [35, 512, 8, 8]           1,024
            ReLU-165            [35, 512, 8, 8]               0
          Conv2d-166            [35, 512, 8, 8]       2,359,296
     BatchNorm2d-167            [35, 512, 8, 8]           1,024
            ReLU-168            [35, 512, 8, 8]               0
          Conv2d-169           [35, 2048, 8, 8]       1,048,576
     BatchNorm2d-170           [35, 2048, 8, 8]           4,096
            ReLU-171           [35, 2048, 8, 8]               0
      Bottleneck-172           [35, 2048, 8, 8]               0
          Conv2d-173           [35, 1024, 8, 8]       2,097,152
     BatchNorm2d-174           [35, 1024, 8, 8]           2,048
          Conv2d-175            [35, 512, 8, 8]       4,719,104
          Conv2d-176            [35, 512, 8, 8]       3,146,240
          Conv2d-177            [35, 512, 8, 8]       3,146,240
          Conv2d-178            [35, 512, 8, 8]       2,097,664
          Conv2d-179            [35, 512, 8, 8]       4,719,104
          Conv2d-180            [35, 512, 8, 8]       3,146,240
          Conv2d-181            [35, 512, 8, 8]       3,146,240
          Conv2d-182            [35, 512, 8, 8]       2,097,664
     BatchNorm2d-183          [35, 512, 16, 16]           1,024
            ReLU-184          [35, 512, 16, 16]               0
          Conv2d-185          [35, 512, 16, 16]       2,359,808
     BatchNorm2d-186          [35, 512, 16, 16]           1,024
     BatchNorm2d-187          [35, 512, 16, 16]           1,024
            ReLU-188          [35, 512, 16, 16]               0
       UpProject-189          [35, 512, 16, 16]               0
          Conv2d-190          [35, 256, 16, 16]       1,179,904
          Conv2d-191          [35, 256, 16, 16]         786,688
          Conv2d-192          [35, 256, 16, 16]         786,688
          Conv2d-193          [35, 256, 16, 16]         524,544
          Conv2d-194          [35, 256, 16, 16]       1,179,904
          Conv2d-195          [35, 256, 16, 16]         786,688
          Conv2d-196          [35, 256, 16, 16]         786,688
          Conv2d-197          [35, 256, 16, 16]         524,544
     BatchNorm2d-198          [35, 256, 32, 32]             512
            ReLU-199          [35, 256, 32, 32]               0
          Conv2d-200          [35, 256, 32, 32]         590,080
     BatchNorm2d-201          [35, 256, 32, 32]             512
     BatchNorm2d-202          [35, 256, 32, 32]             512
            ReLU-203          [35, 256, 32, 32]               0
       UpProject-204          [35, 256, 32, 32]               0
          Conv2d-205          [35, 128, 32, 32]         295,040
          Conv2d-206          [35, 128, 32, 32]         196,736
          Conv2d-207          [35, 128, 32, 32]         196,736
          Conv2d-208          [35, 128, 32, 32]         131,200
          Conv2d-209          [35, 128, 32, 32]         295,040
          Conv2d-210          [35, 128, 32, 32]         196,736
          Conv2d-211          [35, 128, 32, 32]         196,736
          Conv2d-212          [35, 128, 32, 32]         131,200
     BatchNorm2d-213          [35, 128, 64, 64]             256
            ReLU-214          [35, 128, 64, 64]               0
          Conv2d-215          [35, 128, 64, 64]         147,584
     BatchNorm2d-216          [35, 128, 64, 64]             256
     BatchNorm2d-217          [35, 128, 64, 64]             256
            ReLU-218          [35, 128, 64, 64]               0
       UpProject-219          [35, 128, 64, 64]               0
          Conv2d-220           [35, 64, 64, 64]          73,792
          Conv2d-221           [35, 64, 64, 64]          49,216
          Conv2d-222           [35, 64, 64, 64]          49,216
          Conv2d-223           [35, 64, 64, 64]          32,832
          Conv2d-224           [35, 64, 64, 64]          73,792
          Conv2d-225           [35, 64, 64, 64]          49,216
          Conv2d-226           [35, 64, 64, 64]          49,216
          Conv2d-227           [35, 64, 64, 64]          32,832
     BatchNorm2d-228         [35, 64, 128, 128]             128
            ReLU-229         [35, 64, 128, 128]               0
          Conv2d-230         [35, 64, 128, 128]          36,928
     BatchNorm2d-231         [35, 64, 128, 128]             128
     BatchNorm2d-232         [35, 64, 128, 128]             128
            ReLU-233         [35, 64, 128, 128]               0
       UpProject-234         [35, 64, 128, 128]               0
       Dropout2d-235         [35, 64, 128, 128]               0
          Conv2d-236          [35, 1, 128, 128]             577
            ReLU-237          [35, 1, 128, 128]               0
        Upsample-238          [35, 1, 228, 228]               0
================================================================
Total params: 63,565,377
Trainable params: 63,565,377
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 6.94
Forward/backward pass size (MB): 15892.93
Params size (MB): 242.48
Estimated Total Size (MB): 16142.35
----------------------------------------------------------------